app/controllers/adhesions_controller.rb

SELECT * FROM `groups`
---
  def index
	@groups = Group.all