app/controllers/bidules_controller.rb

SELECT * FROM `groups` LIMIT 1
---
	def index
		@g = Group.first