app/controllers/comments_controller.rb

	def index
		@user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

	def show
		@user = User.find(params[:user_id])
		@comment = @user.comments.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.user_id = 1))

	def new
		@user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

	def create
		@user = User.find(params[:user_id])
		@comment = @user.comments.build(params[:comment])
		if @comment.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `comments` (`commenter`, `body`, `user_id`, `created_at`, `updated_at`) VALUES('vcsrfb', 'srbdb', 1, '2010-02-11 10:33:55', '2010-02-11 10:33:55')

	def edit
		@user = User.find(params[:user_id])
		@comment = @user.comments.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.user_id = 1))

	def update
		@user = User.find(params[:user_id])
		@comment = Comment.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

	def destroy
		@user = User.find(params[:user_id])
		@comment = Comment.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)