app/controllers/messages_controller.rb

  def create
    @message = Message.new(params[:message])
	@reception = Reception.new
	@reception.user_id = @message.user_id
	@message.user_id = @current_user.id


    respond_to do |format|
	  if @message.save
---
INSERT INTO `messages` (`user_id`, `titre`, `contenu`, `created_at`, `updated_at`) VALUES(1, 'o', 'o', '2010-06-16 09:43:16', '2010-06-16 09:43:16')
INSERT INTO `receptions` (`user_id`, `message_id`, `etat`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2010-06-16 09:43:16', '2010-06-16 09:43:16')