app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`nom`, `prenom`, `email`, `date_naissance`, `date_inscription`, `last_connect`, `status`, `created_at`, `updated_at`) VALUES('DURAND', 'David', 'cobradelta94@free.fr', '2005-12-10', '2010-02-10 21:23:00', '2010-02-10 21:23:00', NULL, '2010-02-10 21:23:37', '2010-02-10 21:23:37')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `date_naissance` = '2005-05-11', `updated_at` = '2010-05-11 14:45:59' WHERE `id` = 1

  def destroy
	if @current_user.id = params[:id] or @current_user.is_admin?
		@user = User.find(params[:id])
		@user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3